redyuan43/VibeStick/firmware/sticks3/sdkconfig.defaults.cardputer_adv
CONFIG_IDF_TARGET="esp32s3"
CONFIG_IDF_TARGET_ESP32S3=y
CONFIG_ESPTOOLPY_FLASHFREQ_40M=y
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y

# Cardputer-Adv uses ESP32-S3FN8 and has no external PSRAM.
# CONFIG_SPIRAM is not set
CONFIG_LV_FONT_SIMSUN_14_CJK=y

# Keep the physical GO button's double-click scan gesture usable.
CONFIG_BUTTON_SHORT_PRESS_TIME_MS=450

# CONFIG_PARTITION_TABLE_SINGLE_APP is not set
# CONFIG_PARTITION_TABLE_SINGLE_APP_LARGE is not set
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions_ota_1800k.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions_ota_1800k.csv"
